controllers/ConvertController.php

SELECT * FROM `crypto_currency` WHERE (`short_name`='BTC') OR (`short_name`='ETH') OR (`short_name`='ZEC') OR (`short_name`='LTC') ORDER BY `date` DESC
SELECT * FROM `currency` WHERE (`short_name`='CAD') OR (`short_name`='CHF') OR (`short_name`='RUB') OR (`short_name`='USD') OR (`short_name`='GBP') ORDER BY `date` DESC
---
    public function actionIndex()
    {
        $cbu_crypto = CryptoCurrency::find()->where(['or',['short_name' => 'BTC'],['short_name' => 'ETH'],['short_name' => 'ZEC'],['short_name' => 'LTC']])->orderBy(['date' => SORT_DESC])->all();
        $cbu_currency = Currency::find()->where(['or',['short_name' => 'CAD'],['short_name' => 'CHF'],['short_name' => 'RUB'],['short_name' => 'USD'],['short_name' => 'GBP']])->orderBy(['date' => SORT_DESC])->all();

SELECT * FROM `crypto_currency` WHERE `short_name`='BTC'
SELECT * FROM `crypto_currency_rate` WHERE `currency_id`=1 ORDER BY `id` DESC
INSERT INTO `crypto_currency_rate` (`rate`, `date`, `currency_id`, `old_rate`) VALUES (41015.85, 1610197305, 1, 40946.7)
---
    public function actionCrypto()
    {
        $boll = true;
        $result = 0;
        if (isset($_GET['id'])) {
            $result = 1;
        }

        $url = 'https://min-api.cryptocompare.com/data/pricemulti?fsyms=BTC,ETH,ZEC,LTC&tsyms=USD&api_key=d7d314970e28cfce6fc842364c178fb71407b1faafea3121f83006417b350714';
        $str=file_get_contents($url);
        $data1=json_decode($str);
        foreach ($data1 as $key => $value) {
            $data[$key] = $value;
        }

        $time=time();
        foreach ($data as $key=>$cr) {
         if (($model = CryptoCurrency::findOne(['short_name' => $key]))) {
                $old = CryptoCurrencyRate::find()->where(['currency_id' => $model->id])->orderBy(['id'=>SORT_DESC])->one();
                 $rate = new CryptoCurrencyRate();
                 $rate->rate = (float)$cr->USD;
                 $rate->date = $time;
                 $rate->currency_id = $model->id;
                 if (!$old) {
                     $rate->old_rate = (float)$cr->USD;
                 } else {
                     $rate->old_rate = $old->rate;
                 }
                 if (!$rate->save()) {

SELECT * FROM `crypto_currency_rate` WHERE `currency_id`=1 ORDER BY `id`
---
                     break;
             }
            if ($model->save()) {
                     $old = CryptoCurrencyRate::find()->where(['currency_id' => $model->id])->orderBy("id", 'desc')->one();

SELECT * FROM `currency` WHERE `short_name`='CAD'
SELECT * FROM `currency_rate` WHERE `currency_id`=1 ORDER BY `id` DESC
INSERT INTO `currency_rate` (`rate`, `date`, `currency_id`, `old_rate`) VALUES (1.5543, 1610197379, 1, 1.5543)
---
    public function actionCurrency()
    {
        $result = 0;
        if (isset($_GET['id'])) {
            $result = 1;
        }
        $url = 'https://api.exchangeratesapi.io/latest?symbols=USD,GBP,RUB,CAD,CHF';
        $str=file_get_contents($url);
        $data1=json_decode($str);
        foreach ($data1->rates as $key => $value) {
            $data[$key] = $value;
        }
        $time=time();
        foreach ($data as $key=>$cr) {
         if (($model = Currency::findOne(['short_name' => $key]))) {
                $old = CurrencyRate::find()->where(['currency_id' => $model->id])->orderBy(['id'=>SORT_DESC])->one();
                 $rate = new CurrencyRate();
                 $rate->rate = (float)$cr;
                 $rate->date = $time;
                 $rate->currency_id = $model->id;
                 if (!$old) {
                     $rate->old_rate = (float)$cr->USD;
                 } else {
                     $rate->old_rate = $old->rate;
                 }
                 if (!$rate->save(false)) {

SELECT * FROM `currency_rate` WHERE `currency_id`=1 ORDER BY `id`
---
             }

            if ($model->save()) {
                $old = CurrencyRate::find()->where(['currency_id' => $model->id])->orderBy("id", 'desc')->one();